/*
	날짜: 2025 / 10/ 15
	학습목표: 프로그램 사용법 익히기(Visual Studio, Github, GithubDesktop), OT
	키워드: 주석, 세미콜론(;), 중괄호{   }, 들여쓰기
*/

//육하원칙: Who, *What*, How, When, Where, *Why*
//게임 프로그래밍 수업 왜 듣나요? -> 게임을 만들고 싶다.
//Answer: 프로그래밍 언어를 다룰 수 있어야 합니다. Godot, Unreal, Unity
//바로 엔진 수업을 들으면 게임 결과물을 얻을 수 있습니다.

//주석.
//What? 주석이 무엇인가요? 
//      Comment, 컴파일러는 컴퓨터에게 명령을 내릴 수 있습니다. 주석은 컴파일러가 읽을 수 없는 것들.
//Why?  주석을 왜 쓰나요?
//	    1) 코드를 작성하고 나서 그 코드의 상세한 부연 설명을 하고 싶을 때
//      2) 작성한 코드를 임시적으로 실행하지 않게 하기

#include <stdio.h>					 //미리 만들어진 코드를 불러와서 사용할 수 있게 한다.
									 
int main()							 //프로그램 진입점을 표현하는 함수
{									 //프로그램 내용 시작
	printf("Hello World!");          //printf(): 이 안에 작성하면 출력이 된다.
	//x + 3;
}									 //프로그램 내용 끝

//언리얼: C++
//유니티: C#

//왜 C언어를 배울까?
//모든 언어의 조상이 되는 언어이다.
//게임을 만들겠다. 스스로 만들 수 있게 하자. 기본 언어이면서 비슷한 내용이 많아서 첫 학습으로 추천.

// Syntax(구문)와 Semantic(의미)
// 프로그래밍 언어에서 구문은 무엇인가 의미는 무엇인가?
// 정해진 문법을 지키지 않았다. 컴퓨터가 해석을 할 수 없는 사태
//x + 3    총각은 결혼을 한 사람이다.

